/*
 *  [管轄, 緯度, 経度, リンク, CCTV, No., エリア, 期間]
 *
 */
var data = [
  ["B",37.496993,137.279583,"map/map_p098.html","折戸飯田線 珠洲市東山中",1,"NN","W"],
  ["B",37.47794,137.200356,"map/map_p052.html","国道249号 珠洲市大谷峠",2,"NN","W"],
  ["B",37.32544722,136.8189528,"map/map_p034.html","国道249号 門前町中屋",3,"NN","W"],
  ["B",37.321028,137.170658,"map/map_p087.html","国道249号 能登町時長",4,"NN","W"],
  ["B",37.27321667,137.02005,"map/map_p036.html","国道249号 能登町本木",5,"NN","W"],
  ["B",37.413021,137.095696,"map/map_p039.html","宇出津町野線 輪島市町野町若桑",6,"NN","W"],
  ["B",37.34813,137.114546,"map/map_p038.html","宇出津町野線 能登町上町",7,"NN","W"],
  ["B",37.310678,137.144308,"map/map_p041.html","宇出津町野線 能登町宇出津",8,"NN","W"],
  ["B",37.373056,137.042764,"map/map_p089.html","珠洲穴水線 能登町五十里",9,"NN","W"],
  ["B",37.355149,137.158642,"map/map_p088.html","内浦柳田線 能登町駒渡",10,"NN","W"],
  ["B",37.331445,137.006636,"map/map_p035.html","内浦柳田線 能登町当目",11,"NN","W"],
  ["B",37.327589,136.90203,"map/map_p042.html","七尾輪島線 輪島市三井町本江",12,"NN","W"],
  ["B",37.257847,136.88201,"map/map_p040.html","七尾輪島線 穴水町小又",13,"NN","W"],
  ["B",37.298594,136.96196,"map/map_p043.html","柏木穴水線 輪島市三井町洲衛",14,"NN","W"],
  ["B",37.274727,136.920612,"map/map_p037.html","柏木穴水線 穴水町麦ヶ浦",15,"NN","W"],
  ["B",37.268179,136.853943,"map/map_p086.html","穴水門前線 門前町荒屋",16,"NN","W"],
  ["B",37.220923,136.890442,"map/map_p153.html","のと里山海道 越の原～穴水（能登大橋）",17,"NN","W"],
  ["B",37.177001,136.855391,"map/map_p152.html","のと里山海道 別所岳SA",18,"NN","W"],
  ["B",37.212381,136.880497,"map/map_p174.html","のと里山海道 越の原IC",168,"NN","W"],
/*
  ["B",37.201947,136.869007,"map/map_p202.html","のと里山海道 越の原ゆずり",169,"NN","W"],
*/
  ["B",37.191638,136.906428,"map/map_p135.html","国道249号 穴水町字根木",170,"NN","W"],
/*
  ["B",37.472942,137.093024,"map/map_p137.html","国道249号 珠洲市真浦町",171,"NN","W"],
*/
  ["B",37.284994,136.735614,"map/map_p134.html","国道249号 門前町黒島町",172,"NN","W"],
  ["B",37.243985,136.8992519,"map/map_p214.html","七尾輪島線 穴水町此木",173,"NN","W"],
  ["B",37.325013,136.986745,"map/map_p188.html","珠洲穴水線 能登町太田原",174,"NN","W"],
  ["B",37.374948,137.203227,"map/map_p187.html","珠洲穴水線 珠洲市馬渡",175,"NN","W"],
/*
  ["B",37.438611,137.130779,"map/map_p104.html","珠洲里線 若山町上山",176,"NN","W"],
*/
  ["B",37.508608,137.216764,"map/map_p138.html","大谷狼煙飯田線 珠洲市馬緤町",177,"NN","W"],
  ["B",37.515862,137.3304,"map/map_p103.html","大谷狼煙飯田線 珠洲市狼煙町",178,"NN","W"],
  ["B",37.299891,137.171892,"map/map_p136.html","能都内浦線 能登町字羽根",179,"NN","W"],
  ["A",36.927211111111106,136.85370555555556,"map/map_02.html","国道159号 四柳（下）",19,"NS","Y"],
  ["A",36.95905555555556,137.05133333333333,"map/map_01.html","国道160号 大泊2カメラ（下）（大泊県境）",20,"NS","Y"],
  ["B",37.200693,136.707805,"map/map_p044.html","国道249号 志賀町深谷",21,"NS","W"],
  ["B",37.132412,136.863964,"map/map_p054.html","国道249号 中島町鹿島台",22,"NS","W"],
  ["B",37.077701,136.774163,"map/map_p045.html","国道249号 志賀町長田",23,"NS","W"],
  ["B",37.050412,136.927403,"map/map_p058.html","国道249号 七尾市直津",24,"NS","W"],
  ["B",36.982835,136.776395,"map/map_p046.html","国道249号 志賀町大島",25,"NS","W"],
  ["B",36.825088,136.757002,"map/map_p091.html","国道249号 宝達志水町今浜",26,"NS","W"],
  ["B",37.145604,136.762501,"map/map_p051.html","富来中島線 志賀町広地",27,"NS","W"],
/*
  ["B",37.141722,136.849651,"map/map_p151.html","のと里山海道 横田～別所岳（小牧Sカーブ）",28,"NS","W"],
*/
  ["B",37.138446,136.835597,"map/map_p150.html","のと里山海道 横田IC",29,"NS","W"],
  ["B",37.103785,136.821037,"map/map_p149.html","のと里山海道 徳田大津～横田（豊川橋）",30,"NS","W"],
  ["B",37.055871,136.842656,"map/map_p194.html","のと里山海道 徳田大津JCT（金沢側）",31,"NS","W"],
  ["B",37.026465,136.811993,"map/map_p147.html","のと里山海道 西山ゆずり",32,"NS","W"],
  ["B",37.011628,136.806003,"map/map_p193.html","のと里山海道 西山IC",33,"NS","W"],
  ["B",36.983178,136.824954,"map/map_p145.html","のと里山海道 上棚矢駄IC",34,"NS","W"],
  ["B",36.91536,136.774313,"map/map_p144.html","のと里山海道 柳田IC",35,"NS","W"],
  ["B",36.839442,136.751429,"map/map_p143.html","のと里山海道 今浜IC",36,"NS","W"],
  ["B",37.118669,136.99419,"map/map_p060.html","七尾能登島公園線 能登島佐波町",37,"NS","W"],
  ["B",37.076391,136.921234,"map/map_p057.html","七尾能登島公園線 七尾市奥原町",38,"NS","W"],
  ["B",37.013553,136.816422,"map/map_p090.html","末吉七尾線 志賀町安津見",39,"NS","W"],
  ["B",37.005731,136.881945,"map/map_p053.html","志賀田鶴浜線 中能登町瀬戸",40,"NS","W"],
  ["B",36.976424,136.824181,"map/map_p050.html","羽咋田鶴浜線 志賀町上棚",41,"NS","W"],
  ["B",36.97051667,136.9101111,"map/map_p059.html","氷見田鶴浜線 中能登町芹川",42,"NS","W"],
  ["B",36.954029,136.939757,"map/map_p095.html","氷見田鶴浜線 中能登町原山",43,"NS","W"],
  ["B",36.967419,136.866034,"map/map_p056.html","志賀鹿西線 中能登町後山",44,"NS","W"],
  ["B",36.951169,136.849866,"map/map_p055.html","七尾羽咋線 中能登町金丸",45,"NS","W"],
  ["B",36.881689,136.863384,"map/map_p048.html","国道415号 羽咋市神子原町",46,"NS","W"],
  ["B",36.83304722,136.8526139,"map/map_p049.html","高岡羽咋線 宝達志水町所司原",47,"NS","W"],
  ["B",36.791697,136.768284,"map/map_p047.html","国道471号 宝達志水町坪山",48,"NS","W"],
  ["B",37.054875,136.883078,"map/map_p175.html","能越道 七尾市（田鶴浜）",180,"NS","W"],
  ["B",37.144324,136.848758,"map/map_p200.html","のと里山海道 横田～別所岳（小牧橋）",181,"NS","W"],
  ["B",36.862236,136.758214,"map/map_p192.html","のと里山海道 志雄PA",182,"NS","W"],
  ["B",36.96882,136.821837,"map/map_p203.html","のと里山海道 上棚ゆずり",183,"NS","W"],
  ["B",37.011628,136.806003,"map/map_p146.html","のと里山海道 西山PA",184,"NS","W"],
  ["B",37.063387,136.832685,"map/map_p195.html","のと里山海道 徳田大津IC",185,"NS","W"],
  ["B",37.073364,136.825269,"map/map_p196.html","のと里山海道 徳田大津IC（能登側）",186,"NS","W"],
  ["B",37.058738,136.843158,"map/map_p148.html","のと里山海道 徳田大津JCT",187,"NS","W"],
  ["B",36.814212,136.739568,"map/map_p172.html","のと里山海道 米出IC",188,"NS","W"],
  ["B",36.944137,136.804964,"map/map_p198.html","のと里山海道 柳田～上棚矢駄（上中山橋）",189,"NS","W"],
  ["B",37.128671,136.819325,"map/map_p197.html","のと里山海道 横田ゆずり",190,"NS","W"],
  ["B",36.886004,136.765928,"map/map_p173.html","のと里山海道 千里浜IC",191,"NS","W"],
  ["B",37.163036,136.855944,"map/map_p201.html","のと里山海道 別所岳ゆずり",192,"NS","W"],
  ["B",37.143343,136.871374,"map/map_p215.html","国道249号 中島町小牧",193,"NS","W"],
  ["A",36.673825,136.81127500000002,"map/map_03.html","国道8号 九折（下）",49,"KN","Y"],
  ["A",36.62916944444444,136.70033888888887,"map/map_04.html","国道8号 花園（下）",50,"KN","Y"],
  ["A",36.60177777777778,136.65916666666666,"map/map_05.html","国道8号 田中（上）",51,"KN","Y"],
  ["A",36.59371388888889,136.63363055555556,"map/map_07.html","国道8号 南新保（上）",52,"KN","Y"],
  ["A",36.56947647298604,136.60269498825073,"map/map_10.html","国道8号 松島（上）",53,"KN","Y"],
  ["A",36.56929336781621,136.60316437482834,"map/map_11.html","国道8号 松島（下）",54,"KN","Y"],
  ["A",36.57175,136.65550000000002,"map/map_08.html","国道157号 武蔵南（上）",55,"KN","Y"],
  ["A",36.557987222222216,136.64979916666667,"map/map_09.html","国道157号 広小路（下）",56,"KN","Y"],
  ["A",36.58083333333334,136.68694444444444,"map/map_06.html","国道159号 東長江（上）",57,"KN","Y"],
  ["B",36.78623,136.72445,"map/map_p142.html","のと里山海道 高松SA",58,"KN","W"],
  ["B",36.724656,136.686388,"map/map_p141.html","のと里山海道 白尾IC（能登側）",59,"KN","W"],
  ["B",36.666577,136.646147,"map/map_p140.html","のと里山海道 内灘IC",60,"KN","W"],
  ["B",36.646282,136.635675,"map/map_p139.html","のと里山海道 大根部JCT",61,"KN","W"],
  ["B",36.644145,136.62736,"map/map_p154.html","のと里山海道 内灘町（千鳥台）",62,"KN","W"],
  ["B",36.767733,136.734338,"map/map_p081.html","高松津幡線 かほく市内高松",63,"KN","W"],
  ["B",36.73273611,136.8016194,"map/map_p032.html","国道471号 津幡町上河合",64,"KN","W"],
  ["B",36.717787,136.687431,"map/map_p033.html","七塚宇ノ気線 かほく市白尾",65,"KN","W"],
  ["B",36.696864,136.683011,"map/map_p021.html","松任宇ノ気線 かほく市大崎",66,"KN","W"],
  ["B",36.609837,136.62408,"map/map_p133.html","松任宇ノ気線 金沢市御供田町",67,"KN","W"],
  ["B",36.587292,136.589654,"map/map_p027.html","松任宇ノ気線 金沢市佐奇森町",68,"KN","W"],
  ["B",36.67023,136.784618,"map/map_p092.html","森本津幡線 津幡町刈安",69,"KN","W"],
  ["B",36.619704,136.781158,"map/map_p082.html","国道359号 金沢市中尾町",70,"KN","W"],
  ["B",36.59193,136.677609,"map/map_p132.html","国道359号 金沢市小坂町",71,"KN","W"],
  ["B",36.614748,136.692796,"map/map_p129.html","森本津幡線 金沢市南森本",72,"KN","W"],
  ["B",36.600228,136.729397,"map/map_p076.html","国道304号 金沢市宮野町",73,"KN","W"],
  ["B",36.591944,136.7575,"map/map_p210.html","国道304号 金沢市清水谷町",74,"KN","W"],
  ["B",36.57294,136.608623,"map/map_p003.html","上安原昭和町線 古府アンダー",75,"KN","W"],
  ["B",36.559276,136.590756,"map/map_p004.html","倉部金沢線 上安原高速アンダー",76,"KN","W"],
  ["B",36.555292,136.760795,"map/map_p084.html","金沢井波線 金沢市二俣町",77,"KN","W"],
  ["B",36.552405,136.687646,"map/map_p079.html","金沢小松線 金沢市もりの里",78,"KN","W"],
  ["B",36.537756,136.691648,"map/map_p078.html","金沢小松線 金沢市錦町",79,"KN","W"],
  ["B",36.533325,136.679717,"map/map_p077.html","金沢小松線 金沢市大桑町",80,"KN","W"],
  ["B",36.513232,136.629796,"map/map_p075.html","金沢小松線 金沢市大額町",81,"KN","W"],
  ["B",36.501857,136.618123,"map/map_p001.html","金沢小松線 四十万アンダー",82,"KN","W"],
  ["B",36.544549,136.622441,"map/map_p002.html","宮永横川町線 米泉アンダー",83,"KN","W"],
  ["B",36.527993,136.756878,"map/map_p071.html","芝原石引町線 医王山",84,"KN","W"],
  ["B",36.515366,136.691626,"map/map_p130.html","倉谷土清水線 金沢市末町",85,"KN","W"],
  ["B",36.502194,136.674589,"map/map_p085.html","小原土清水線 金沢市別所町",86,"KN","W"],
  ["B",36.493746,136.754369,"map/map_p131.html","金沢湯涌福光線 金沢市芝原町",87,"KN","W"],
  ["B",36.636701,136.621602,"map/map_p189.html","のと里山海道 千鳥台起点",194,"KN","W"],
  ["B",36.640504,136.632385,"map/map_p190.html","のと里山海道 内灘町（海浜向陽台）",195,"KN","W"],
  ["B",36.675855,136.652875,"map/map_p199.html","のと里山海道 内灘白帆台IC",196,"KN","W"],
  ["B",36.714135,136.681398,"map/map_p191.html","のと里山海道 白尾IC（金沢側）",197,"KN","W"],
  ["B",36.762433,136.710205,"map/map_p171.html","のと里山海道 高松IC",198,"KN","W"],
  ["B",36.548962,136.740823,"map/map_p105.html","金沢井波線 金沢市清水町",199,"KN","W"],
  ["B",36.613539,136.644689,"map/map_p207.html","金沢外環状道路 海側幹線 金沢市大河端町",200,"KN","W"],
  ["B",36.612423,136.677805,"map/map_p206.html","金沢外環状道路 海側幹線 金沢市福久町",201,"KN","W"],
  ["B",36.619463,136.65903,"map/map_p102.html","向粟崎安江町線 金沢市木越町",202,"KN","W"],
  ["B",36.695872,136.728246,"map/map_p170.html","高松津幡線 津幡町谷内",203,"KN","W"],
  ["B",36.763442,136.765762,"map/map_p180.html","国道471号 かほく市箕打",204,"KN","W"],
  ["C",36.604,136.795,"map/map_kenkyou.html","北陸道 石川・富山県境付近",88,"KN","W"],
  ["C",36.596,136.764,"map/map_kanazawamorimoto_ic.html","北陸道 金沢森本ＩＣ付近",89,"KN","W"],
  ["C",36.56482331285096,136.5983498096466,"map/map_kanazawanishi_ic.html","北陸道 金沢西ＩＣ",90,"KN","W"],
  ["D",36.625145,136.674347,"http://www.city.kanazawa.ishikawa.jp/sekisetu/road/01.html","大場町西",91,"KN","W"],
  ["D",36.576982,136.660844,"http://www.city.kanazawa.ishikawa.jp/sekisetu/road/02.html","瓢箪町",92,"KN","W"],
  ["D",36.553898,136.609707,"http://www.city.kanazawa.ishikawa.jp/sekisetu/road/04.html","八日市出町",93,"KN","W"],
  ["D",36.549072,136.659493,"http://www.city.kanazawa.ishikawa.jp/sekisetu/road/03.html","清川町",94,"KN","W"],
  ["A",36.54425,136.60048055555555,"map/map_12.html","国道8号 二日市跨線橋（上）",95,"KG","Y"],
  ["A",36.4680473893999,136.49742364883423,"map/map_13.html","国道8号 手取川大橋（下）",96,"KG","Y"],
  ["A",36.26138888888889,136.28777777777776,"map/map_15.html","国道8号 牛の谷（下）",97,"KG","Y"],
  ["A",36.440877352979896,136.63004279136658,"map/map_14.html","国道157号 山上郷大橋",98,"KG","Y"],
  ["B",36.555632,136.580272,"map/map_p010.html","松任宇ノ気線 中新保アンダー（山側）",99,"KG","W"],
  ["B",36.551159,136.579692,"map/map_p011.html","松任宇ノ気線 中新保アンダー（海側）",100,"KG","W"],
  ["B",36.534467,136.578676,"map/map_p008.html","松任宇ノ気線 五歩市JRアンダー（山側）",101,"KG","W"],
  ["B",36.529873,136.579151,"map/map_p009.html","松任宇ノ気線 五歩市JRアンダー（海側）",102,"KG","W"],
  ["B",36.547337,136.556489,"map/map_p006.html","倉部成線 竹松アンダー",103,"KG","W"],
  ["B",36.540359,136.536466,"map/map_p005.html","金沢美川小松線 浜相川アンダー",104,"KG","W"],
  ["B",36.538907,136.536498,"map/map_p074.html","金沢美川小松線 白山市徳光町",105,"KG","W"],
  ["B",36.483611,136.477951,"map/map_p072.html","金沢美川小松線 白山市美川南町",106,"KG","W"],
  ["B",36.52273,136.55449,"map/map_p012.html","松任美川線 成町アンダー",107,"KG","W"],
  ["B",36.482321,136.58201,"map/map_p096.html","金沢小松線 白山市藤木町",108,"KG","W"],
  ["B",36.458405,136.546626,"map/map_p026.html","金沢小松線 能美市辰口橋",109,"KG","W"],
  ["B",36.456809,136.57554,"map/map_p017.html","金沢小松線 川北大橋",110,"KG","W"],
  ["B",36.432134,136.537271,"map/map_p024.html","金沢小松線 能美市徳山町",111,"KG","W"],
  ["B",36.406548,136.508163,"map/map_p061.html","金沢小松線 小松市荒木田町",112,"KG","W"],
  ["B",36.48432,136.483854,"map/map_p007.html","鶴来水島美川線 美川アンダー",113,"KG","W"],
  ["B",36.42376,136.462356,"map/map_p016.html","粟生小松線 松梨アンダー",114,"KG","W"],
  ["B",36.406143,136.417043,"map/map_p025.html","国道360号 小松空港前",115,"KG","W"],
  ["B",36.372345,136.552586,"map/map_p023.html","国道360号 小松市上麦口",116,"KG","W"],
  ["B",36.366935,136.588576,"map/map_p068.html","国道360号 白山市三坂町",117,"KG","W"],
  ["B",36.292267,136.646737,"map/map_p066.html","国道360号 白山市瀬戸",118,"KG","W"],
  ["B",36.272654,136.708138,"map/map_p067.html","国道360号 白山市尾添（一里野）",119,"KG","W"],
  ["B",36.358502,136.42818,"map/map_p093.html","国道305号 小松市符津町",120,"KG","W"],
  ["B",36.305088,136.32186,"map/map_p013.html","国道305号 菅生アンダー",121,"KG","W"],
  ["B",36.343082,136.634474,"map/map_p062.html","国道157号 白山市吉野",122,"KG","W"],
  ["B",36.235698,136.632864,"map/map_p063.html","国道157号 白山市鴇ヶ谷",123,"KG","W"],
  ["B",36.178739,136.623831,"map/map_p064.html","国道157号 白山市白峰",124,"KG","W"],
  ["B",36.143177,136.587353,"map/map_p065.html","国道157号 白山市谷峠",125,"KG","W"],
  ["B",36.342331,136.361929,"map/map_p031.html","山中伊切線 加賀市片山津町",126,"KG","W"],
  ["B",36.33587,136.480086,"map/map_p094.html","大杉長谷線 小松市瀬領町",127,"KG","W"],
  ["B",36.324074,136.357635,"map/map_p014.html","片山津山代線 作見アンダー",128,"KG","W"],
  ["B",36.304707,136.396894,"map/map_p029.html","小松山中線 加賀市栄谷",129,"KG","W"],
  ["B",36.301709,136.317163,"map/map_p015.html","荒木田原町線 幸町アンダー",130,"KG","W"],
  ["B",36.291183,136.292717,"map/map_p030.html","加賀インター線 加賀市熊坂町",131,"KG","W"],
  ["B",36.280183,136.350696,"map/map_p099.html","国道364号 加賀市河南町",132,"KG","W"],
  ["B",36.225981,136.360878,"map/map_p028.html","国道364号 加賀市山中温泉栢野",133,"KG","W"],
  ["B",36.514204,136.612745,"map/map_p106.html","額谷三浦線 野々市市粟田",205,"KG","W"],
  ["B",36.416676,136.430889,"map/map_p183.html","金沢美川小松線 小松市長崎町",206,"KG","W"],
  ["B",36.4697234,136.4833836,"map/map_p208.html","金沢美川小松線 川北能美大橋",207,"KG","W"],
  ["B",36.37444444,136.4138889,"map/map_p176.html","串加賀線 小松市村松町",208,"KG","W"],
  ["B",36.289005,136.297363,"map/map_p204.html","荒木田原町線 加賀市高山跨線橋海側",209,"KG","W"],
  ["B",36.289853,136.300828,"map/map_p205.html","荒木田原町線 加賀市高山跨線橋山側",210,"KG","W"],
  ["B",36.282485,136.319933,"map/map_p184.html","荒木田原町線 加賀市曽宇町",211,"KG","W"],
  ["B",36.288958,136.262748,"map/map_p182.html","国道305号 加賀市永井町",212,"KG","W"],
  ["B",36.34,136.4197222,"map/map_p178.html","国道305号 小松市矢田野町",213,"KG","W"],
  ["B",36.209066,136.349261,"map/map_p181.html","国道364号 加賀市山中温泉我谷町",214,"KG","W"],
  ["B",36.281959,136.356031,"map/map_p185.html","小松山中線 加賀市山代温泉南町",215,"KG","W"],
  ["B",36.32416667,136.4341667,"map/map_p179.html","小松山中線 小松市馬場町",216,"KG","W"],
  ["B",36.450181,136.617823,"map/map_p121.html","小松鶴来線 能美市岩本町",217,"KG","W"],
  ["B",36.34305556,136.4033333,"map/map_p177.html","新保矢田野線 小松市矢田町",218,"KG","W"],
  ["B",36.292406,136.381331,"map/map_p186.html","水田丸黒瀬線 加賀市上野町",219,"KG","W"],
  ["C",36.53,136.523,"map/map_tokumitu_pa.html","北陸道 徳光ＰＡ",134,"KG","W"],
  ["C",36.48082009996466,136.47442638874054,"map/map_mikawa_ic.html","北陸道 美川ＩＣ付近",135,"KG","W"],
  ["C",36.305,136.285,"map/map_kaga_ic.html","北陸道 加賀ＩＣ付近",136,"KG","W"],
  ["A",36.524444,136.583333,"map/map_35.html","国道8号 乾交差点（上）",137,"KG","Y"],
  ["A",36.388394,136.493089,"map/map_36.html","国道8号 八幡ＩＣ（下）",138,"KG","Y"],
  ["A",36.379167,136.481944,"map/map_37.html","国道8号 東山高架橋（下）",139,"KG","Y"],
  ["A",36.673,136.806444,"map/map_16.html","国道8号 河内橋（下）",140,"KN","W"],
  ["A",36.672045,136.800773,"map/map_17.html","国道8号 大岩橋（下）",141,"KN","W"],
  ["A",36.672933,136.793022,"map/map_18.html","国道8号 坂戸（下）",142,"KN","W"],
  ["A",36.674167,136.786667,"map/map_19.html","国道8号 刈安出口（上）",143,"KN","W"],
  ["A",36.673808,136.781272,"map/map_20.html","国道8号 刈安ランプ（下）",144,"KN","W"],
  ["A",36.676417,136.773456,"map/map_21.html","国道8号 岩崎トンネル坑口（下）",145,"KN","W"],
  ["A",36.678514,136.769083,"map/map_22.html","国道8号 倉見・岩崎間（下）",146,"KN","W"],
  ["A",36.681242,136.7624,"map/map_23.html","国道8号 倉見トンネル坑口（上）",147,"KN","W"],
  ["A",36.681836,136.758972,"map/map_24.html","国道8号 倉見高架橋（下）",148,"KN","W"],
  ["A",36.683781,136.752556,"map/map_25.html","国道8号 平谷（下）",149,"KN","W"],
  ["A",36.684761,136.743956,"map/map_26.html","国道8号 緑が丘交差点（下）",150,"KN","W"],
  ["A",36.6855,136.733389,"map/map_27.html","国道8号 津幡除雪ステーション（下）",151,"KN","W"],
  ["A",36.686314,136.729242,"map/map_28.html","国道8号 加茂ＩＣ（上）",152,"KN","W"],
  ["A",36.681944,136.722778,"map/map_29.html","国道8号 舟橋ジャンクション（上）",153,"KN","W"],
  ["A",36.290278,136.297222,"map/map_30.html","国道8号 加賀ＩＣ入口（上）",154,"KG","W"],
  ["A",36.278694,136.291789,"map/map_31.html","国道8号 熊坂（下）",155,"KG","W"],
  ["A",36.2765,136.290417,"map/map_32.html","国道8号 熊坂ポンプ場（上）",156,"KG","W"],
  ["A",36.272917,136.289389,"map/map_33.html","国道8号 熊坂ＪＲ（上）",157,"KG","W"],
  ["A",36.266417,136.289017,"map/map_34.html","国道8号 熊坂２（下）",158,"KG","W"],
  ["A",37.238732,136.901466,"map/map_44.html","国道470号 穴水（下）",159,"NN","Y"],
  ["A",37.321058,136.910065,"map/map_45.html","国道470号 のと三井ＩＣ（下）",160,"NN","Y"],
  ["A",37.285029,136.926373,"map/map_46.html","国道470号 のと里山空港ＩＣ（下）",161,"NN","Y"],
  ["A",37.0525,137.008889,"map/map_38.html","国道160号 大田（下）",162,"NS","Y"],
  ["A",37.047589,137.047358,"map/map_39.html","国道160号 百海（下）",163,"NS","Y"],
  ["A",37.025,137.05,"map/map_40.html","国道160号 虫崎（下）",164,"NS","Y"],
  ["A",37.013481,137.046439,"map/map_41.html","国道160号 佐々波（上）",165,"NS","Y"],
  ["A",37.020664,136.952863,"map/map_42.html","国道470号 七尾ＩＣ（上）",166,"NS","Y"],
  ["A",36.973218,137.04762,"map/map_43.html","国道470号 大泊ＩＣ（上）",167,"NS","Y"]
];
var mon = new Date().getMonth() + 1;
data = data.filter(function(x) {
  if (x[0] == 'B') {
    return mon == 11 || mon == 12 || mon == 1 || mon == 2 || mon == 3;
  } else if (x[0] == 'C' || x[0] == 'D') {
    return mon == 12 || mon == 1 || mon == 2 || mon == 3;
  } else if (x[7] == 'W') { /* 冬季のみ（A） */
    return mon == 11 || mon == 12 || mon == 1 || mon == 2 || mon == 3;
  }
  return true;
});

/* 能登（北） */
var area_noto1 = [
  [37.496993, 137.279583],
  [37.220923, 136.81895278]
];
/* 能登（南） */
var area_noto2 = [
  [37.257847, 137.0516666],
  [36.666577, 136.646147]
];
/* 金沢 */
var area_kanazawa = [
  [36.696864, 136.811275],
  [36.493746, 136.523]
];
/* 加賀 */
var area_kaga = [
  [36.513232, 136.708138],
  [36.143177, 136.2877777]
];
var map = null;
var icons = { A:'kuni', B:'ken', C:'nexco', D:'shi' };
jQuery(function($) {
  if ($('#gmap').length == 0) return;
  map = roadmap('gmap', 36.474307, 136.503753, 10, 'cyberjapandata');
  map.fitBounds(area_bounds);
  for (var i = 0; i < data.length; i++) {
    var marker = map.addMarker(data[i][1], data[i][2]);
    marker.setIcon(L.icon({
      iconUrl:'icn-assets/'+icons[data[i][0]]+'.png',
      iconSize: [30, 40],
      iconAnchor: [15, 39]
    }));
    marker.setUserData('provider', data[i][0]);
    marker.url = data[i][3];
    marker.bindTooltip(data[i][4], { 'className':'tooltips' });
    $(marker).on('click', function() {
      var subwin;
      if (screen.width >= 800) {
        subwin = window.open('about:blank', 'WindowName', 'width=800,height=800,resizable=yes,scrollbars=yes');
      } else {
        subwin = window.open('about:blank', 'WindowName', 'resizable=yes,scrollbars=yes');
      }
      subwin.location.href = this.url;
      subwin.focus();
    });
  }
  map.setMaxBounds([
    [ 36.066938, 136.243061 ],
    [ 37.855281, 137.365281 ]
  ]);
});
